# Dockerfile

# Используем легковесный официальный образ Node.js с поддержкой bun
FROM oven/bun:1-slim

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем файлы проекта. Сначала package.json для кеширования слоев
COPY package.json .

# Устанавливаем зависимости. Bun выполнит это очень быстро, 
# так как зависимостей нет, но шаг важен для будущих добавлений.
RUN bun install

# Копируем остальной код приложения
COPY app/ app/

# Создаем директорию для сохранения изображений
# Этот шаг важен для работы volume
RUN mkdir -p /app/images

# Указываем команду для запуска приложения
CMD ["bun", "run", "start"]